{
	"mainBlog": {
		"mainCategory": "IoT",
		"title": "Invisible Talking Camera Using Python",
		"featuredImage": "https://images.ctfassets.net/eowwrv5buqcq/6fBcxSKAVQ3OFbPkdXfZWr/2aeeeeaaa2cfc66c27c03275cf330da7/image.png",
		"postDate": "2019-05-05T00:00:00.000+05:30",
		"id": "5NCdethgGWdzylLaFMQPIQ",
		"categoryID": "iot",
		"excerpt": "The Invisible talking camera uses Python OpenCV and pyttsx library in order to calibrate your background based on HSL thresholding.\nIt then performs bit wise operations background subtraction along with minor Gaussian Bluring and smoothening and segmentation to make you invisible in the frame!\nPyTTS is used to talk with your program to give basic inputs like initiating calibration, varying thresholds etc."
	},
	"rankedBlogs": [
		{
			"mainCategory": "IoT",
			"title": "How To Make Your Own Artificial Spider Sense Device?",
			"postDate": "2019-05-15T00:00:00.000+05:30",
			"id": "6YFNbCpC6LYHhccXdyf4oo",
			"categoryID": "iot",
			"featuredImage": "https://images.ctfassets.net/eowwrv5buqcq/7tVFtoXSQB5yqmThMBsYlt/6ef2579858198a151af10c0e91775368/how-to-make-your-own-artificial-spider-sense-device--jw4cozxs.jpeg",
			"excerpt": "We all have grown up watching cool superhero movies and cartoon series. Every superhero is involved either with some cool super power or super awesome sci-fi tech. Spiderman is one of those. I personally like the character most due to the fact I can relate so many things to him. The guy is so much like any youngster struggling with their everyday life and it feels good to see them on screen.\nSo today I'll explain to you the way to make your own Artificial spider sense device. For those of you who are unaware of what exactly is spider-sense. Well, it's actually kind of a sixth sense which aware Spiderman of dangers around him. It is shown more like a psychic power in TV series and cartoons but actually, it works in a different sense."
		},
		{
			"mainCategory": "Mechanical",
			"title": "Additive Manufacturing and SolidWorks",
			"postDate": "2019-12-25T00:00:00.000+05:30",
			"id": "3aLEKtdfPgti7hIgz2PLJo",
			"categoryID": "mechanical",
			"featuredImage": "https://images.ctfassets.net/eowwrv5buqcq/2VGZR6l5I1GknOyHUMBuib/cc940b915f8007fad81edc0082df7ec5/thumbnail-additive-manufacturing-and-solidworks.png",
			"excerpt": "We all know Additive Manufacturing is booming today’s industrial sector. With the help of Additive manufacturing, there’s now almost no limit to design constraints and material wastage is also reduced by a significant amount.\nHere’s a small discussion about utilizing additive manufacturing using SolidWorks.\nFDM (Fused Deposition Modelling) is the very basic and the most common in today’s market. The printer uses layer by layer extrusion can be generally carried out in an open area. FDM printers are easier to maintain compared to other printers and also least expensive, with the flexibility to use multiple spool types in order to have better printing experience."
		},
		{
			"mainCategory": "Life",
			"title": "Dear Best Friend...",
			"postDate": "2019-05-30T00:00:00.000+05:30",
			"id": "WrKoeYkBOfWNBXdyp7Wuk",
			"categoryID": "life",
			"featuredImage": "https://images.ctfassets.net/eowwrv5buqcq/7u25VSC3DZfhvFyucAH2Wn/b8cd18452cdf91692a5812a79af85a6b/the-garden-or-words-featured-image-jwa531ht.jpeg",
			"excerpt": "I did stand for you. I understand we all have preferences and sometimes our experiments can go wrong. I know deep inside you were crying hard but then you just smiled and moved out.\nLater when I came to you, you just cried hard and hugged me tight and I said everything will be alright and see today it is."
		},
		{
			"mainCategory": "Web Development",
			"title": "Getting Started With HTML and Web Development",
			"postDate": "2020-03-22T00:00:00.000+05:30",
			"id": "1gFsRM3HHf95pAb9IGuFv7",
			"categoryID": "web-development",
			"featuredImage": "https://images.ctfassets.net/eowwrv5buqcq/6ywjAk5sqc4QkjHAQdj0w/24b83c86f814b95920abd06b2c959941/webdev.jpeg",
			"excerpt": "For a better sense of understanding, take an example of the entire human body. The skeleton of the human body is the HTML part of it. Skeleton is the supporting structure consisting of bones and joints.\nComing next, the skin and external hair and everything is CSS, which gives the entire body an external appearance. It decides about how your website will look.\nFinally, the muscles and the organs are what JS does. It defines all sorts of functionality to your website and so you can perform actions like walking, running, sleeping, eating, etc."
		}
	],
	"relatedBlogs": [
		{
			"mainCategory": "Mobile App Development",
			"title": "Thriller StoryBook App in Flutter",
			"postDate": "2019-07-31T00:00:00.000+05:30",
			"id": "4YMPrxuotjCLYKKeCYx5bk",
			"categoryID": "mobile-app-development",
			"featuedImage": "https://images.ctfassets.net/eowwrv5buqcq/4y55dG7U2XBVd2CmbvgNRK/0522c2a5a8cab09faf92ae218d4bf445/4-1-e1570947245316.jpg"
		},
		{
			"mainCategory": "Automation",
			"title": "UIPath Startup Script on Windows 10 Server",
			"postDate": "2023-01-28T00:00:00.000+05:30",
			"id": "57ipaNewAcgnAjQsTKOja9",
			"categoryID": "automation",
			"featuedImage": "https://images.ctfassets.net/eowwrv5buqcq/5JRUplrKPNg1kw0pCCNrDo/92833035562e8892b45d2f1702ca35dd/thumbnail-uipath-setup.png"
		}
	]
}
